In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\syedf\anaconda3\lib\site-packages (8.0.32)
Collecting protobuf<=3.20.3,>=3.11.0
  Downloading protobuf-3.20.3-cp39-cp39-win_amd64.whl (904 kB)
Installing collected packages: protobuf
Successfully installed protobuf-3.20.3

In [2]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\syedf\anaconda3\lib\site-packages (8.0.32)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\syedf\anaconda3\lib\site-packages (from mysql-connector-python) (3.20.3)

In [23]:
import mysql.connector as connection

In [24]:
conn = connection.connect(host="localhost",user="root", passwd="0913",use_pure=True)

In [25]:
cur = conn.cursor()

In [26]:
cur.execute("show databases")

In [27]:
res = cur.fetchall()

In [28]:
res

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('syed',),
 ('sys',),
 ('world',)]

In [29]:
for i in res :
    print(i[0])

information_schema
mysql
performance_schema
sakila
syed
sys
world

In [30]:
for i in res :
    print(i)

('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('syed',)
('sys',)
('world',)

In [31]:
import mysql.connector as connection

In [32]:
conn = connection.connect(host="localhost",user="root", passwd="0913",use_pure=True)

In [33]:
cur = conn.cursor()

In [34]:
cur.execute("create database syedxyzzz")

In [35]:
conn = connection.connect(host="localhost",database = "syedxyzzz" , user="root", passwd="0913",use_pure=True)

In [37]:
conn.is_connected()

True

In [38]:
cur = conn.cursor()

In [39]:
cur.execute("create table test1(x1 INT (7),x2 VARCHAR (10), x3 DATE)")

In [40]:
conn.close()

In [60]:
mydb = connection.connect(host = 'localhost', database = 'syedxyzzz', user = 'root', passwd = '0913', use_pure = True)

In [42]:
mydb.is_connected()

True

In [43]:
cur = mydb.cursor()

In [44]:
cur.execute("insert into test1 values(54396,'bcse','2029-09-16')")

In [45]:
mydb.commit()

In [48]:
cur.execute("insert into test1 values(54396,'bcse','2029-09-16')")
cur.execute("insert into test1 values(54396,'bcse','2029-09-16')")
cur.execute("insert into test1 values(54396,'bcse','2029-09-16')")
cur.execute("insert into test1 values(54396,'bcse','2029-09-16')")
cur.execute("insert into test1 values(54396,'bcse','2029-09-16')")
cur.execute("insert into test1 values(54396,'bcse','2029-09-16')")
cur.execute("insert into test1 values(54396,'bcse','2029-09-16')")
cur.execute("insert into test1 values(54396,'bcse','2029-09-16')")
cur.execute("insert into test1 values(54396,'bcse','2029-09-16')")
cur.execute("insert into test1 values(54396,'bcse','2029-09-16')")
cur.execute("insert into test1 values(54396,'bcse','2029-09-16')")

In [49]:
mydb.commit()

In [61]:
cur = mydb.cursor()

In [62]:
cur.execute('select * from test1')

In [63]:
for i in cur.fetchall():
    print(i)

(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))
(54396, 'bcse', datetime.date(2029, 9, 16))

In [64]:
for i in cur.fetchall():
    print(i)

In [65]:
cur = mydb.cursor()

In [66]:
cur.execute("select x1, x2 from test1")

In [67]:
for i in cur.fetchall():
    print(i)

(54396, 'bcse')
(54396, 'bcse')
(54396, 'bcse')
(54396, 'bcse')
(54396, 'bcse')
(54396, 'bcse')
(54396, 'bcse')
(54396, 'bcse')
(54396, 'bcse')
(54396, 'bcse')
(54396, 'bcse')
(54396, 'bcse')
(54396, 'bcse')
(54396, 'bcse')
(54396, 'bcse')
(54396, 'bcse')
(54396, 'bcse')
(54396, 'bcse')
(54396, 'bcse')
(54396, 'bcse')

In [80]:
import pandas as pd

In [81]:
mydb

In [71]:
pd.read_sql("select * from syedxyzzz.test1",mydb)

       x1    x2          x3
0   54396  bcse  2029-09-16
1   54396  bcse  2029-09-16
2   54396  bcse  2029-09-16
3   54396  bcse  2029-09-16
4   54396  bcse  2029-09-16
5   54396  bcse  2029-09-16
6   54396  bcse  2029-09-16
7   54396  bcse  2029-09-16
8   54396  bcse  2029-09-16
9   54396  bcse  2029-09-16
10  54396  bcse  2029-09-16
11  54396  bcse  2029-09-16
12  54396  bcse  2029-09-16
13  54396  bcse  2029-09-16
14  54396  bcse  2029-09-16
15  54396  bcse  2029-09-16
16  54396  bcse  2029-09-16
17  54396  bcse  2029-09-16
18  54396  bcse  2029-09-16
19  54396  bcse  2029-09-16

In [72]:
pd.read_sql("select x1,x2 from syedxyzzz.test1",mydb)

       x1    x2
0   54396  bcse
1   54396  bcse
2   54396  bcse
3   54396  bcse
4   54396  bcse
5   54396  bcse
6   54396  bcse
7   54396  bcse
8   54396  bcse
9   54396  bcse
10  54396  bcse
11  54396  bcse
12  54396  bcse
13  54396  bcse
14  54396  bcse
15  54396  bcse
16  54396  bcse
17  54396  bcse
18  54396  bcse
19  54396  bcse

In [74]:
pd.read_sql("select * from test1",mydb)

       x1    x2          x3
0   54396  bcse  2029-09-16
1   54396  bcse  2029-09-16
2   54396  bcse  2029-09-16
3   54396  bcse  2029-09-16
4   54396  bcse  2029-09-16
5   54396  bcse  2029-09-16
6   54396  bcse  2029-09-16
7   54396  bcse  2029-09-16
8   54396  bcse  2029-09-16
9   54396  bcse  2029-09-16
10  54396  bcse  2029-09-16
11  54396  bcse  2029-09-16
12  54396  bcse  2029-09-16
13  54396  bcse  2029-09-16
14  54396  bcse  2029-09-16
15  54396  bcse  2029-09-16
16  54396  bcse  2029-09-16
17  54396  bcse  2029-09-16
18  54396  bcse  2029-09-16
19  54396  bcse  2029-09-16

In [75]:
pd.read_sql("select x1,x1 from syedxyzzz.test1",mydb)

       x1     x1
0   54396  54396
1   54396  54396
2   54396  54396
3   54396  54396
4   54396  54396
5   54396  54396
6   54396  54396
7   54396  54396
8   54396  54396
9   54396  54396
10  54396  54396
11  54396  54396
12  54396  54396
13  54396  54396
14  54396  54396
15  54396  54396
16  54396  54396
17  54396  54396
18  54396  54396
19  54396  54396

In [76]:
pd.read_sql("select x1,x1,x3 from syedxyzzz.test1",mydb)

       x1     x1          x3
0   54396  54396  2029-09-16
1   54396  54396  2029-09-16
2   54396  54396  2029-09-16
3   54396  54396  2029-09-16
4   54396  54396  2029-09-16
5   54396  54396  2029-09-16
6   54396  54396  2029-09-16
7   54396  54396  2029-09-16
8   54396  54396  2029-09-16
9   54396  54396  2029-09-16
10  54396  54396  2029-09-16
11  54396  54396  2029-09-16
12  54396  54396  2029-09-16
13  54396  54396  2029-09-16
14  54396  54396  2029-09-16
15  54396  54396  2029-09-16
16  54396  54396  2029-09-16
17  54396  54396  2029-09-16
18  54396  54396  2029-09-16
19  54396  54396  2029-09-16

In [82]:
a = pd.read_sql("select x3,x1,x2 from syedxyzzz.test1",mydb)

In [83]:
a

            x3     x1    x2
0   2029-09-16  54396  bcse
1   2029-09-16  54396  bcse
2   2029-09-16  54396  bcse
3   2029-09-16  54396  bcse
4   2029-09-16  54396  bcse
5   2029-09-16  54396  bcse
6   2029-09-16  54396  bcse
7   2029-09-16  54396  bcse
8   2029-09-16  54396  bcse
9   2029-09-16  54396  bcse
10  2029-09-16  54396  bcse
11  2029-09-16  54396  bcse
12  2029-09-16  54396  bcse
13  2029-09-16  54396  bcse
14  2029-09-16  54396  bcse
15  2029-09-16  54396  bcse
16  2029-09-16  54396  bcse
17  2029-09-16  54396  bcse
18  2029-09-16  54396  bcse
19  2029-09-16  54396  bcse

In [84]:
a.to_csv("mydata.csv")

In [85]:
mydb = connection.connect(host = 'localhost', database = 'syedxyzzz', user = 'root', passwd = '0913', use_pure = True)

In [86]:
mydb

In [87]:
cur = mydb.cursor()

In [88]:
cur.execute("create table mydata(n1 int(20) , n2 varchar(20) , n3 date)")

In [89]:
data = pd.read_csv('mydata.csv')

In [90]:
data

    Unnamed: 0          x3     x1    x2
0            0  2029-09-16  54396  bcse
1            1  2029-09-16  54396  bcse
2            2  2029-09-16  54396  bcse
3            3  2029-09-16  54396  bcse
4            4  2029-09-16  54396  bcse
5            5  2029-09-16  54396  bcse
6            6  2029-09-16  54396  bcse
7            7  2029-09-16  54396  bcse
8            8  2029-09-16  54396  bcse
9            9  2029-09-16  54396  bcse
10          10  2029-09-16  54396  bcse
11          11  2029-09-16  54396  bcse
12          12  2029-09-16  54396  bcse
13          13  2029-09-16  54396  bcse
14          14  2029-09-16  54396  bcse
15          15  2029-09-16  54396  bcse
16          16  2029-09-16  54396  bcse
17          17  2029-09-16  54396  bcse
18          18  2029-09-16  54396  bcse
19          19  2029-09-16  54396  bcse

In [91]:
import mysql.connector as connection
import pandas as pd
import csv

In [92]:
mydb = connection.connect(host = "localhost", user="root", passwd="0913",use_pure=True) 
mydb

In [93]:
cur = mydb.cursor()

In [94]:
cur.execute("create database newxyzzz")

In [96]:
mydb = connection.connect(host = "localhost", database = "newxyzzz", user="root", passwd="0913",use_pure=True) 
mydb
cur = mydb.cursor()
cur.execute("create table test12(x1 INT (7),x2 VARCHAR (10), x3 DATE)")
mydb.close()

In [97]:
mydb = connection.connect(host = "localhost", database = "newxyzzz", user="root", passwd="0913",use_pure=True) 
mydb

In [98]:
cur = mydb.cursor()
cur.execute("insert into test12 values(54396,'bcse','2029-09-16')")
mydb.commit()

In [100]:
cur.execute("insert into test12 values(54395,'bcse','2029-09-10')")
cur.execute("insert into test12 values(54393,'bcse','2029-09-12')")
cur.execute("insert into test12 values(54391,'bcse','2029-09-15')")
cur.execute("insert into test12 values(54386,'bcse','2029-09-18')")
cur.execute("insert into test12 values(54324,'bcse','2029-09-13')")
cur.execute("insert into test12 values(54332,'bcse','2029-09-12')")
cur.execute("insert into test12 values(54346,'bcse','2029-09-19')")
cur.execute("insert into test12 values(54315,'bcse','2029-09-14')")
cur.execute("insert into test12 values(54382,'bcse','2029-09-15')")
cur.execute("insert into test12 values(54337,'bcse','2029-09-11')")
cur.execute("insert into test12 values(54391,'bcse','2029-09-16')")

In [101]:
mydb.commit()

In [102]:
mydb = connection.connect(host = "localhost", database = "newxyzzz", user="root", passwd="0913",use_pure=True) 
mydb

In [103]:
cur = mydb.cursor()

In [104]:
cur.execute("delete from test12 where x1 = 54324")

In [105]:
mydb.commit()

In [106]:
cur = mydb.cursor()
cur.execute("update test12 set x1 = 12563, x2 = 'yusuf' where x1 = 54391")

In [107]:
mydb.commit()

In [108]:
mydb.close()